app/controllers/language_families_controller.rb

  def index
    @language_families = LanguageFamily.all
---
SELECT "language_families".* FROM "language_families"

  def create
    @language_family = LanguageFamily.new(language_family_params)

    respond_to do |format|
      if @language_family.save
---
INSERT INTO "language_families" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 17 Oct 2013 00:13:37 UTC +00:00], ["name", "Indo European"], ["updated_at", Thu, 17 Oct 2013 00:13:37 UTC +00:00]]

    def set_language_family
      @language_family = LanguageFamily.find(params[:id])
---
SELECT "language_families".* FROM "language_families" WHERE "language_families"."id" = ? LIMIT 1  [["id", "1"]]