app/controllers/languages_controller.rb

SELECT "languages".* FROM "languages"
---
  def index
    @languages = Language.all

INSERT INTO "languages" ("created_at", "language_family_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 17 Oct 2013 00:14:00 UTC +00:00], ["language_family_id", 1], ["name", "English"], ["updated_at", Thu, 17 Oct 2013 00:14:00 UTC +00:00]]
---
  def create
    @language = Language.new(language_params)

    respond_to do |format|
      if @language.save

SELECT "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_language
      @language = Language.find(params[:id])